app/controllers/picks_controller.rb

  def create
    @pick = Pick.create(comment: pick_params[:comment], article_id: pick_params[:article_id], user_id: current_user.id)
---
INSERT INTO `picks` (`article_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 3, '2018-05-11 23:08:38', '2018-05-11 23:08:38')